#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-kZY71UnDor9FXntP

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4c805131-a0d6-4d27-8b87-e88afb2ab35e]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_cloudfront_response_headers_policy.security_headers_policy: Refreshing state... [id=dbd58526-3795-4dea-a38a-b0d743f4caaf]
data.aws_route53_zone.philward_io_zone: Reading...
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_route53_zone.philward_io_zone: Read complete after 0s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_philward.io_A]
aws_route53_record.resume_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.acm_certificate must be replaced
+/- resource "aws_acm_certificate" "acm_certificate" {
      ~ arn                       = "arn:aws:acm:us-east-1:542829616420:certificate/4c805131-a0d6-4d27-8b87-e88afb2ab35e" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.philward.io"
              - resource_record_name  = "_c88ce6dbd651a4d32d84f8a6aa562e90.philward.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b84c77fccaa6319b23f86bc1f842402c.dhzvlrndnj.acm-validations.aws."
            },
            # (2 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:us-east-1:542829616420:certificate/4c805131-a0d6-4d27-8b87-e88afb2ab35e" -> (known after apply)
      ~ not_after                 = "2023-10-06T23:59:59Z" -> (known after apply)
      ~ not_before                = "2022-09-07T00:00:00Z" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "philward.io",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ aliases                        = [
          + "philward.io",
            # (1 unchanged element hidden)
        ]
        id                             = "E5CPX462LFNKX"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:542829616420:certificate/4c805131-a0d6-4d27-8b87-e88afb2ab35e" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_route53_record.acm_validation_record["*.philward.io"] must be replaced
-/+ resource "aws_route53_record" "acm_validation_record" {
      ~ fqdn            = "_c88ce6dbd651a4d32d84f8a6aa562e90.philward.io" -> (known after apply)
      ~ id              = "Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME" -> (known after apply)
      ~ name            = "_c88ce6dbd651a4d32d84f8a6aa562e90.philward.io" -> (known after apply) # forces replacement
      ~ records         = [
          - "_b84c77fccaa6319b23f86bc1f842402c.dhzvlrndnj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.acm_validation_record["philward.io"] will be created
  + resource "aws_route53_record" "acm_validation_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z003529526RCV8G5J1PS7"
    }

Plan: 3 to add, 1 to change, 2 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*